import os


# ========== 基础界面配置（固定元素）==========

主界面 = {
    "标识": "主界面",
    "方式": "找图",
    "颜色偏色": ["72B23F-1A1D1D", "A33631-312B2D"],
    "状态": {
        "是否未选中任务栏": {
            "方式": "找图",
            "颜色偏色": ["979B78-120E0C", "97916D-121817"],
            # 查找区域使用数组格式 [x, y, w, h]
            "查找区域": [1951, 160, 188, 85],
            "图片路径": os.path.join(
                os.path.dirname(__file__), "主界面_未选中任务.png"
            ),
        },
    },
    "按钮": {
        "活动": [574, 24, 73, 73],
        "对话框第一个选项按钮": {
            "方式": "找图",
            "偏移点击区域": [25, 110, 406, 65],
            # 查找区域使用数组格式 [x, y, w, h]
            "查找区域": [1600, 0, 700, 800],
            "相似度": 0.7,
            "颜色偏色": ["C9BDB8-262325"],
            "图片路径": os.path.join(os.path.dirname(__file__), "请选择要做的事.png"),
        },
        "使用": {
            "方式": "找图",
            "图片路径": os.path.join(os.path.dirname(__file__), "使用按钮.png"),
        },
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "主界面.png"),
}


活动界面 = {
    "标识": "活动界面",
    "方式": "找图",
    "按钮": {
        "抓鬼任务": {
            "方式": "找图",
            "偏移点击区域": [308, 33, 116, 56],
            "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务.png"),
        },
        "宝图任务": {
            "方式": "找图",
            "偏移点击区域": [304, 30, 121, 54],
            "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务.png"),
        },
        "秘境降妖": {
            "方式": "找图",
            "偏移点击区域": [306, 24, 118, 64],
            "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖.png"),
        },
        "师门任务": {
            "方式": "找图",
            "偏移点击区域": [309, 27, 120, 63],
            "图片路径": os.path.join(os.path.dirname(__file__), "师门任务.png"),
        },
        "运镖": {
            "方式": "找图",
            "偏移点击区域": [310, 31, 118, 55],
            "图片路径": os.path.join(os.path.dirname(__file__), "运镖.png"),
        },
        "第一个活跃奖励": [883, 801, 90, 91],
        "第二个活跃奖励": [1102, 804, 99, 88],
        "第三个活跃奖励": [1331, 806, 99, 83],
        "第四个活跃奖励": [1555, 808, 102, 76],
        "第五个活跃奖励": [1780, 810, 103, 75],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "活动界面.png"),
}


队伍弹框界面 = {
    "标识": "队伍弹框界面",
    "方式": "找图",
    "状态": {
        "是否队伍没满": {
            "方式": "找图",
            "图片路径": os.path.join(os.path.dirname(__file__), "队伍没满.png"),
        }
    },
    "按钮": {
        "关闭": [1866, 35, 61, 62],
        "选择等级": [1491, 146, 58, 53],
        "一键喊话": [1628, 953, 261, 72],
        "世界频道": [1641, 693, 232, 96],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "队伍界面.png"),
}

便捷组队弹框界面 = {
    "标识": "便捷组队弹框界面",
    "方式": "找图",
    "按钮": {"创建队伍": [897, 950, 264, 70]},
    "图片路径": os.path.join(os.path.dirname(__file__), "便捷组队弹框界面.png"),
}

调整组队等级界面 = {
    "标识": "调整组队等级界面",
    "方式": "找图",
    "按钮": {
        "70-89等级": [1516, 467, 112, 54],
        "1-69等级": [1383, 467, 114, 53],
        "90-115等级": [1646, 466, 116, 52],
        "确定": [1086, 948, 230, 67],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "调整组队等级界面.png"),
}

战斗界面 = {
    "标识": "战斗界面",
    "方式": "找图",
    "查找区域": [2161, 876, 217, 192],
    "颜色偏色": [
        "C87141-181C17",
        "C86941-182417",
        "D37E57-233A2D",
        "FFC68B-000205",
        "FEC68B-010205",
    ],
    "图片路径": os.path.join(os.path.dirname(__file__), "战斗界面.png"),
    "状态": {
        "是否未准备战斗": {
            "方式": "找图",
            "颜色偏色": [
                "F8F0C8-000000",
                "DED2A2-1C1D20",
                "DED196-1C1E2C",
                "A78556-000000",
            ],
            "偏移点击区域": [0, -73, 81, 72],
            "查找区域": [2193, 994, 121, 67],
            "相似度": 0.8,
            "图片路径": os.path.join(os.path.dirname(__file__), "准备战斗.png"),
        },
    },
    "按钮": {"未准备战斗": [2210, 935, 79, 76]},
}


缺人自动匹配提示 = {
    "标识": "缺人自动匹配提示",
    "方式": "找图",
    "按钮": {"关闭": [1257, 617, 210, 68]},
    "图片路径": os.path.join(os.path.dirname(__file__), "缺人自动匹配提示.png"),
}


战斗失败界面 = {
    "标识": "战斗失败界面",
    "方式": "找图",
    "按钮": {"关闭": [1538, 381, 696, 512]},
    "图片路径": os.path.join(os.path.dirname(__file__), "战斗失败.png"),
}


摆摊弹框界面 = {
    "标识": "摆摊弹框界面",
    "方式": "找图",
    "按钮": {
        "关闭": [1875, 34, 64, 65],
        "第一个商品": [940, 239, 396, 149],
        "购买": [1625, 947, 263, 73],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "摆摊界面.png"),
}


任务物品选择弹框界面 = {
    "标识": "任务物品选择弹框界面",
    "方式": "找图",
    "按钮": {"关闭": [2238, 128, 66, 64], "上交": [1878, 848, 214, 74]},
    "图片路径": os.path.join(os.path.dirname(__file__), "任务物品选择界面.png"),
}

继续剧情对话界面 = {
    "标识": "继续剧情对话界面",
    "方式": "找图",
    "按钮": {
        "任意位置": [1165, 224, 794, 564],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "继续剧情对话界面.png"),
}


# ========== 抓鬼任务模块 ==========

主界面_钟馗对话 = {
    "方式": "找图",
    "按钮": {"抓鬼任务": [1829, 361, 403, 66]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/钟馗.png"),
}

主界面_抓鬼文字 = {
    "方式": "opencv找透明图",
    "偏移点击区域": [0, 0, 350, 114],
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/主界面_抓鬼文字.png"),
}

队伍缺辅助提示 = {
    "标识": "队伍缺辅助提示",
    "方式": "找图",
    "按钮": {"关闭": [940, 640, 201, 69]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/队伍缺辅助.png"),
}


继续抓鬼提示 = {
    "标识": "继续抓鬼提示",
    "方式": "找图",
    "按钮": {"关闭": [936, 593, 205, 65]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/继续抓鬼提示.png"),
}


# ========== 宝图任务模块 ==========

主界面_店小二对话 = {
    "方式": "找图",
    "按钮": {
        "听听无妨": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "宝图任务/听听无妨.png"
            ),
        }
    },
    "图片路径": os.path.join(
        os.path.dirname(__file__), "宝图任务/主界面_店小二对话.png"
    ),
}

主界面_宝图文字 = {
    "方式": "找图",
    "颜色偏色": ["CACC24-2D2B25"],
    "偏移点击区域": [0, 0, 348, 123],
    "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务/主界面_宝图文字.png"),
}


# ========== 秘境降妖模块 ==========

秘境降妖弹框界面 = {
    "标识": "秘境降妖弹框界面",
    "方式": "找图",
    "按钮": {"继续挑战": [1754, 892, 84, 92]},
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/秘境降妖弹框界面.png"
    ),
}

选项框_秘境降妖按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/选项框_秘境降妖按钮.png"
    ),
}

主界面_秘境降妖文字 = {
    "方式": "opencv找透明图",
    "偏移点击区域": [0, 0, 363, 109],
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/主界面_秘境降妖文字.png"
    ),
}

主界面_离开秘境降妖按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}

主界面_进入战斗按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/对话框_进入战斗按钮.png"
    ),
}

主界面_离开按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}


# ========== 师门任务模块 ==========

师门任务弹框界面 = {
    "标识": "师门任务弹框界面",
    "方式": "找图",
    "按钮": {
        "关闭": [1898, 200, 37, 35],
        "选择按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/选择按钮.png"
            ),
        },
        "去完成按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/去完成按钮.png"
            ),
        },
        "继续任务按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/继续任务按钮.png"
            ),
        },
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "师门任务/师门任务界面.png"),
}

主界面_师门文字 = {
    "方式": "找图",
    "偏移点击区域": [0, 0, 336, 121],
    "颜色偏色": ["CACC24-2D2B25"],
    "图片路径": os.path.join(os.path.dirname(__file__), "师门任务/主界面_师门文字.png"),
}

师门任务完成界面 = {
    "标识": "师门任务完成界面",
    "方式": "找图",
    "按钮": {
        "确定": [1040, 800, 321, 69],
    },
    "图片路径": os.path.join(
        os.path.dirname(__file__), "师门任务/师门任务完成界面.png"
    ),
}

# ========== 运镖模块 ==========


押送普通镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银.png"),
}

押送高级镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银.png"),
}

押送普通镖银提示 = {
    "方式": "找图",
    "标识": "押送普通镖银提示",
    "按钮": {
        "确定": [1256, 588, 207, 75],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银提示.png"),
}

押送高级镖银提示 = {
    "方式": "找图",
    "标识": "押送高级镖银提示",
    "按钮": {
        "确定": [1259, 634, 202, 74],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银提示.png"),
}


运镖地图界面 = {
    "方式": "找图",
    "标识": "运镖地图界面",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/运镖地图界面.png"),
}
