# key为字库查找字符串，value为查询参数
# 第一层必须为界面, 第二层为当前界面可以判断的状态和可以点击的按钮
# 状态肯定是需要查询的
# 按钮分为需要查询(使用{})和不需要查询的界面固定元素(直接使用[])

# 转换配置逻辑
# 转换时,如果是需要进行查询的,那么都会将key,作为查找字符串,新增进配置里面
# 如果不需要查询的,就不需要查找字符串这个字段,直接将[]中作为配置里面的点击区域

# 配置
# aaa = {
#     "主界面": {
#         "查找区域": [77, 249, 136, 136],
#         "状态": {
#             "是否未选中任务栏": {},
#         },
#         "按钮": {
#             "活动": [574, 24, 73, 73],
#             "对话框第一个选项按钮": {"相似度": 0.75},
#             "任务面板_宝图文字": {},
#             "任务面板_师门文字": {},
#             "使用": [77, 249, 136, 136],
#         },
#     },
# }
# 转换后的配置
# aaa = {
#     '主界面': {
#         '查找字符串': '主界面',
#         '查找区域': [77, 249, 136, 136],
#         '状态': {
#             '是否未选中任务栏': Field实例
#             },
#         '按钮': {
#             '活动': Field实例,
#             '对话框第一个选项按钮': Field实例,
#             '任务面板_宝图文字': Field实例,
#             '任务面板_ 师门文字': Field实例,
#             '使用': Field实例
#             }
#         }
# }


界面集合 = {
    "主界面": {
        "查找区域": [77, 249, 136, 136],
        "状态": {
            "未选中任务栏": {},
            "队伍少于三人": {},
        },
        "按钮": {
            "活动": [574, 24, 73, 73],
            "对话框第一个选项按钮": {"相似度": 0.75},
            "任务面板_宝图文字": {},
            "任务面板_师门文字": {},
            "任务面板_抓鬼文字": {},
            "使用": {},
        },
    },
    "活动界面": {
        "按钮": {
            "抓鬼任务": {},
            "宝图任务": {},
            "秘境降妖": {},
            "师门任务": {},
            "运镖": {},
            "第一个活跃奖励": [883, 801, 90, 91],
            "第二个活跃奖励": [1102, 804, 99, 88],
            "第三个活跃奖励": [1331, 806, 99, 83],
            "第四个活跃奖励": [1555, 808, 102, 76],
            "第五个活跃奖励": [1780, 810, 103, 75],
        },
    },
    "战斗界面": {
        "相似度": 0.8,
        "状态": {
            "未准备战斗": {},
        },
    },
    "队伍弹框界面": {
        "状态": {"队伍没满": {}},
        "按钮": {
            "关闭": [1866, 35, 61, 62],
            "选择等级": [1491, 146, 58, 53],
            "一键喊话": [1628, 953, 261, 72],
            "世界频道": [1641, 693, 232, 96],
        },
    },
    "便捷组队弹框界面": {
        "按钮": {"创建队伍": [897, 950, 264, 70]},
    },
    "调整组队等级界面": {
        "按钮": {
            "一至六十九等级": [1383, 467, 114, 53],
            "七十至八十九等级": [1516, 467, 112, 54],
            "九十至一百一十五等级": [1646, 466, 116, 52],
            "确定": [1086, 948, 230, 67],
        },
    },
    "摆摊弹框界面": {
        "按钮": {
            "关闭": [1875, 34, 64, 65],
            "第一个商品": [940, 239, 396, 149],
            "购买": [1625, 947, 263, 73],
        },
    },
    "师门任务弹框界面": {
        "按钮": {
            "关闭": [1898, 200, 37, 35],
            "选择": {},
            "继续任务": {},
        },
    },
    "继续剧情对话界面": {
        "按钮": {
            "任意位置": [1165, 224, 794, 564],
        },
    },
    "药店界面": {
        "按钮": {"关闭": [1925, 47, 58, 52], "购买": [1569, 846, 264, 68]},
    },
    "兵器铺界面": {
        "按钮": {"关闭": [1925, 47, 58, 52], "购买": [1567, 848, 263, 62]},
    },
    "任务物品选择弹框界面": {
        "按钮": {"关闭": [2238, 128, 66, 64], "上交": [1878, 848, 214, 74]},
    },
    "师门任务完成界面": {
        "按钮": {"确定": [1045, 800, 315, 67]},
    },
    # "队伍缺辅助提示界面": {
    #     "按钮": {"关闭": [940, 640, 201, 69]},
    # },
    "缺人调整队伍提示界面": {
        "按钮": {"关闭": [939, 618, 201, 62], "确定": [1258, 617, 207, 63]},
    },
    "缺人自动匹配提示界面": {
        "按钮": {"关闭": [936, 616, 206, 66], "确定": [1255, 615, 208, 69]},
    },
    "继续抓鬼提示界面": {
        "按钮": {"关闭": [937, 594, 202, 65], "确定": [1256, 595, 206, 65]},
    },
}
