import os


# ========== 基础界面配置（固定元素）==========

主界面 = {
    "界面": "主界面",
    "查找字符串": "主界面",
    "查找区域": [77, 249, 136, 136],
    "状态": {
        "是否未选中任务栏": {
            "查找字符串": "未选中任务栏",
            "点击区域": [1954, 166, 170, 80]
        },
    },
    "按钮": {
        "活动": [574, 24, 73, 73],
        "对话框第一个选项按钮": {
            "查找字符串": "请选择要做的事",
            "相似度": 0.8,
            "偏移点击区域": [24,103,410,68],
        },
        "使用": {
            "查找字符串": "",
        },
    },
}


活动界面 = {
    "界面": "活动界面",
    "查找字符串": "活动界面",
    "按钮": {
        "抓鬼任务": {
            "查找字符串": "抓鬼任务",
            "偏移点击区域": [303,21,122,66],
        },
        "宝图任务": {
            "查找字符串": "宝图任务",
            "偏移点击区域": [303,21,122,66],
        },
        "秘境降妖": {
            "查找字符串": "秘境降妖",
            "偏移点击区域": [303,21,122,66],
        },
        "师门任务": {
            "查找字符串": "师门任务",
            "偏移点击区域": [303,21,122,66],
        },
        "运镖": {
            "查找字符串": "运镖",
            "偏移点击区域": [303,21,122,66],
        },
        "第一个活跃奖励": [883, 801, 90, 91],
        "第二个活跃奖励": [1102, 804, 99, 88],
        "第三个活跃奖励": [1331, 806, 99, 83],
        "第四个活跃奖励": [1555, 808, 102, 76],
        "第五个活跃奖励": [1780, 810, 103, 75],
    },
}


队伍弹框界面 = {
    "界面": "队伍弹框界面",
    "查找字符串": "队伍界面",
    "状态": {
        "是否队伍没满": {
            "查找字符串": "队伍空缺",
        }
    },
    "按钮": {
        "关闭": [1866, 35, 61, 62],
        "选择等级": [1491, 146, 58, 53],
        "一键喊话": [1628, 953, 261, 72],
        "世界频道": [1641, 693, 232, 96],
    },
}

便捷组队弹框界面 = {
    "界面": "便捷组队弹框界面",
    "查找字符串": "便捷组队界面",
    "按钮": {"创建队伍": [897, 950, 264, 70]},
}

调整组队等级界面 = {
    "界面": "调整组队等级界面",
    "查找字符串": "调整组队等级界面",
    "按钮": {
        "70-89等级": [1516, 467, 112, 54],
        "1-69等级": [1383, 467, 114, 53],
        "90-115等级": [1646, 466, 116, 52],
        "确定": [1086, 948, 230, 67],
    },
}

战斗界面 = {
    "界面": "战斗界面",
    "查找字符串": "战斗界面",
    "相似度": 0.8,
    "状态": {
        "是否未准备战斗": {
            "查找字符串": "未自动战斗",
            "偏移点击区域": [-4,-76,85,73],
        },
    }
}


摆摊弹框界面 = {
    "界面": "摆摊弹框界面",
    "查找字符串": "摆摊界面",
    "按钮": {
        "关闭": [1875, 34, 64, 65],
        "第一个商品": [940, 239, 396, 149],
        "购买": [1625, 947, 263, 73],
    },
}













缺人自动匹配提示 = {
    "界面": "缺人自动匹配提示",
    "方式": "找图",
    "按钮": {"关闭": [1257, 617, 210, 68]},
    "图片路径": os.path.join(os.path.dirname(__file__), "缺人自动匹配提示.png"),
}


战斗失败界面 = {
    "界面": "战斗失败界面",
    "方式": "找图",
    "按钮": {"关闭": [1538, 381, 696, 512]},
    "图片路径": os.path.join(os.path.dirname(__file__), "战斗失败.png"),
}





任务物品选择弹框界面 = {
    "界面": "任务物品选择弹框界面",
    "方式": "找图",
    "按钮": {"关闭": [2238, 128, 66, 64], "上交": [1878, 848, 214, 74]},
    "图片路径": os.path.join(os.path.dirname(__file__), "任务物品选择界面.png"),
}

继续剧情对话界面 = {
    "界面": "继续剧情对话界面",
    "方式": "找图",
    "按钮": {
        "任意位置": [1165, 224, 794, 564],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "继续剧情对话界面.png"),
}


# ========== 抓鬼任务模块 ==========

主界面_钟馗对话 = {
    "方式": "找图",
    "按钮": {"抓鬼任务": [1829, 361, 403, 66]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/钟馗.png"),
}

主界面_抓鬼文字 = {
    "方式": "opencv找透明图",
    "偏移点击区域": [0, 0, 350, 114],
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/主界面_抓鬼文字.png"),
}

队伍缺辅助提示 = {
    "界面": "队伍缺辅助提示",
    "方式": "找图",
    "按钮": {"关闭": [940, 640, 201, 69]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/队伍缺辅助.png"),
}


继续抓鬼提示 = {
    "界面": "继续抓鬼提示",
    "方式": "找图",
    "按钮": {"关闭": [936, 593, 205, 65]},
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/继续抓鬼提示.png"),
}


# ========== 宝图任务模块 ==========

主界面_店小二对话 = {
    "方式": "找图",
    "按钮": {
        "听听无妨": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "宝图任务/听听无妨.png"
            ),
        }
    },
    "图片路径": os.path.join(
        os.path.dirname(__file__), "宝图任务/主界面_店小二对话.png"
    ),
}

主界面_宝图文字 = {
    "方式": "找图",
    "颜色偏色": ["CACC24-2D2B25"],
    "偏移点击区域": [0, 0, 348, 123],
    "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务/主界面_宝图文字.png"),
}


# ========== 秘境降妖模块 ==========

秘境降妖弹框界面 = {
    "界面": "秘境降妖弹框界面",
    "方式": "找图",
    "按钮": {"继续挑战": [1754, 892, 84, 92]},
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/秘境降妖弹框界面.png"
    ),
}

选项框_秘境降妖按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/选项框_秘境降妖按钮.png"
    ),
}

主界面_秘境降妖文字 = {
    "方式": "opencv找透明图",
    "偏移点击区域": [0, 0, 363, 109],
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/主界面_秘境降妖文字.png"
    ),
}

主界面_离开秘境降妖按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}

主界面_进入战斗按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/对话框_进入战斗按钮.png"
    ),
}

主界面_离开按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}


# ========== 师门任务模块 ==========

师门任务弹框界面 = {
    "界面": "师门任务弹框界面",
    "方式": "找图",
    "按钮": {
        "关闭": [1898, 200, 37, 35],
        "选择按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/选择按钮.png"
            ),
        },
        "去完成按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/去完成按钮.png"
            ),
        },
        "继续任务按钮": {
            "方式": "找图",
            "图片路径": os.path.join(
                os.path.dirname(__file__), "师门任务/继续任务按钮.png"
            ),
        },
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "师门任务/师门任务界面.png"),
}

主界面_师门文字 = {
    "方式": "找图",
    "偏移点击区域": [0, 0, 336, 121],
    "颜色偏色": ["CACC24-2D2B25"],
    "图片路径": os.path.join(os.path.dirname(__file__), "师门任务/主界面_师门文字.png"),
}

师门任务完成界面 = {
    "界面": "师门任务完成界面",
    "方式": "找图",
    "按钮": {
        "确定": [1040, 800, 321, 69],
    },
    "图片路径": os.path.join(
        os.path.dirname(__file__), "师门任务/师门任务完成界面.png"
    ),
}

# ========== 运镖模块 ==========


押送普通镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银.png"),
}

押送高级镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银.png"),
}

押送普通镖银提示 = {
    "界面": "押送普通镖银提示",
    "方式": "找图",
    "按钮": {
        "确定": [1256, 588, 207, 75],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银提示.png"),
}

押送高级镖银提示 = {
    "界面": "押送高级镖银提示",
    "方式": "找图",
    "按钮": {
        "确定": [1259, 634, 202, 74],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银提示.png"),
}


运镖地图界面 = {
    "界面": "运镖地图界面",
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/运镖地图界面.png"),
}
