config = {
    "主界面": {
        "界面": "主界面",
        "查找字符串": "主界面",
        "查找区域": [77, 249, 136, 136],
        "状态": {
            "是否未选中任务栏": {
                "查找字符串": "未选中任务栏",
                "点击区域": [1954, 166, 170, 80],
            },
        },
        "按钮": {
            "活动": [574, 24, 73, 73],
            "对话框第一个选项按钮": {
                "查找字符串": "请选择要做的事",
                "相似度": 0.8,
                "偏移点击区域": [24, 103, 410, 68],
            },
            "使用": {
                "查找字符串": "",
            },
        },
    },
    "活动界面": {
        "界面": "活动界面",
        "查找字符串": "活动界面",
        "按钮": {
            "抓鬼任务": {
                "查找字符串": "抓鬼任务",
                "偏移点击区域": [303, 21, 122, 66],
            },
            "宝图任务": {
                "查找字符串": "宝图任务",
                "偏移点击区域": [303, 21, 122, 66],
            },
            "秘境降妖": {
                "查找字符串": "秘境降妖",
                "偏移点击区域": [303, 21, 122, 66],
            },
            "师门任务": {
                "查找字符串": "师门任务",
                "偏移点击区域": [303, 21, 122, 66],
            },
            "运镖": {
                "查找字符串": "运镖",
                "偏移点击区域": [303, 21, 122, 66],
            },
            "第一个活跃奖励": [883, 801, 90, 91],
            "第二个活跃奖励": [1102, 804, 99, 88],
            "第三个活跃奖励": [1331, 806, 99, 83],
            "第四个活跃奖励": [1555, 808, 102, 76],
            "第五个活跃奖励": [1780, 810, 103, 75],
        },
    },
    "战斗界面": {
        "界面": "战斗界面",
        "查找字符串": "战斗界面",
        "相似度": 0.8,
        "状态": {
            "是否未准备战斗": {
                "查找字符串": "未自动战斗",
                "偏移点击区域": [-4, -76, 85, 73],
            },
        },
    },
    "队伍弹框界面": {
        "界面": "队伍弹框界面",
        "查找字符串": "队伍界面",
        "状态": {
            "是否队伍没满": {
                "查找字符串": "队伍空缺",
            }
        },
        "按钮": {
            "关闭": [1866, 35, 61, 62],
            "选择等级": [1491, 146, 58, 53],
            "一键喊话": [1628, 953, 261, 72],
            "世界频道": [1641, 693, 232, 96],
        },
    },
    "便捷组队弹框界面": {
        "界面": "便捷组队弹框界面",
        "查找字符串": "便捷组队界面",
        "按钮": {"创建队伍": [897, 950, 264, 70]},
    },
    "调整组队等级界面": {
        "界面": "调整组队等级界面",
        "查找字符串": "调整组队等级界面",
        "按钮": {
            "70-89等级": [1516, 467, 112, 54],
            "1-69等级": [1383, 467, 114, 53],
            "90-115等级": [1646, 466, 116, 52],
            "确定": [1086, 948, 230, 67],
        },
    },
    "摆摊弹框界面": {
        "界面": "摆摊弹框界面",
        "查找字符串": "摆摊界面",
        "按钮": {
            "关闭": [1875, 34, 64, 65],
            "第一个商品": [940, 239, 396, 149],
            "购买": [1625, 947, 263, 73],
        },
    },
}
