import os










战斗失败界面 = {
    "界面": "战斗失败界面",
    "方式": "找图",
    "按钮": {"关闭": [1538, 381, 696, 512]},
    "图片路径": os.path.join(os.path.dirname(__file__), "战斗失败.png"),
}




# ========== 秘境降妖模块 ==========

秘境降妖弹框界面 = {
    "界面": "秘境降妖弹框界面",
    "方式": "找图",
    "按钮": {"继续挑战": [1754, 892, 84, 92]},
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/秘境降妖弹框界面.png"
    ),
}

选项框_秘境降妖按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/选项框_秘境降妖按钮.png"
    ),
}

主界面_秘境降妖文字 = {
    "方式": "opencv找透明图",
    "偏移点击区域": [0, 0, 363, 109],
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/主界面_秘境降妖文字.png"
    ),
}

主界面_离开秘境降妖按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}

主界面_进入战斗按钮 = {
    "方式": "找图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/对话框_进入战斗按钮.png"
    ),
}

主界面_离开按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(
        os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"
    ),
}



# ========== 运镖模块 ==========


押送普通镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银.png"),
}

押送高级镖银 = {
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银.png"),
}

押送普通镖银提示 = {
    "界面": "押送普通镖银提示",
    "方式": "找图",
    "按钮": {
        "确定": [1256, 588, 207, 75],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送普通镖银提示.png"),
}

押送高级镖银提示 = {
    "界面": "押送高级镖银提示",
    "方式": "找图",
    "按钮": {
        "确定": [1259, 634, 202, 74],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/押送高级镖银提示.png"),
}


运镖地图界面 = {
    "界面": "运镖地图界面",
    "方式": "找图",
    "图片路径": os.path.join(os.path.dirname(__file__), "运镖/运镖地图界面.png"),
}
