"""
界面配置

key 为字库查找字符串，value 为查询参数
第一层必须为界面, 第二层为当前界面可以判断的状态和可以点击的按钮
状态肯定是需要查询的
按钮分为需要查询(使用{})和不需要查询的界面固定元素(直接使用[])
"""

界面集合 = {
    "主界面": {
        "查找区域": [77, 249, 136, 136],
        "状态": {
            "未选中任务栏": {},
            "队伍少于三人": {},
        },
        "按钮": {
            "活动": [574, 24, 73, 73],
            "对话框第一个选项按钮": {"相似度": 0.7},
            "任务面板_宝图文字": {},
            "任务面板_师门文字": {},
            "任务面板_抓鬼文字": {},
            "任务面板_秘境降妖文字": {},
            "秘境降妖离开": {},
            "使用": {},
        },
    },
    "活动界面": {
        "按钮": {
            "抓鬼任务": {"相似度": 0.7},
            "宝图任务": {"相似度": 0.7},
            "秘境降妖": {"相似度": 0.7},
            "师门任务": {"相似度": 0.7},
            "运镖": {"相似度": 0.7},
            "第一个活跃奖励": [883, 801, 90, 91],
            "第二个活跃奖励": [1102, 804, 99, 88],
            "第三个活跃奖励": [1331, 806, 99, 83],
            "第四个活跃奖励": [1555, 808, 102, 76],
            "第五个活跃奖励": [1780, 810, 103, 75],
        },
    },
    "战斗界面": {
        "相似度": 0.8,
        "状态": {
            "未准备战斗": {},
        },
    },
    "队伍弹框界面": {
        "状态": {"队伍没满": {}},
        "按钮": {
            "关闭": [1866, 35, 61, 62],
            "选择等级": [1491, 146, 58, 53],
            "一键喊话": [1628, 953, 261, 72],
            "世界频道": [1641, 693, 232, 96],
        },
    },
    "便捷组队弹框界面": {
        "按钮": {"创建队伍": [897, 950, 264, 70]},
    },
    "调整组队等级界面": {
        "按钮": {
            "一至六十九等级": [1383, 467, 114, 53],
            "七十至八十九等级": [1516, 467, 112, 54],
            "九十至一百一十五等级": [1646, 466, 116, 52],
            "确定": [1086, 948, 230, 67],
        },
    },
    "摆摊弹框界面": {
        "按钮": {
            "关闭": [1875, 34, 64, 65],
            "第一个商品": [940, 239, 396, 149],
            "购买": [1625, 947, 263, 73],
        },
    },
    "师门任务弹框界面": {
        "按钮": {
            "关闭": [1898, 200, 37, 35],
            "选择": {},
            "继续任务": {},
        },
    },
    "继续剧情对话界面": {
        "按钮": {
            "任意位置": [1165, 224, 794, 564],
        },
    },
    "药店界面": {
        "按钮": {"关闭": [1925, 47, 58, 52], "购买": [1569, 846, 264, 68]},
    },
    "兵器铺界面": {
        "按钮": {"关闭": [1925, 47, 58, 52], "购买": [1567, 848, 263, 62]},
    },
    "任务物品选择弹框界面": {
        "按钮": {"关闭": [2238, 128, 66, 64], "上交": [1878, 848, 214, 74]},
    },
    "师门任务完成界面": {
        "按钮": {"确定": [1045, 800, 315, 67]},
    },
    "缺人调整队伍提示界面": {
        "按钮": {"关闭": [939, 618, 201, 62], "确定": [1258, 617, 207, 63]},
    },
    "缺人自动匹配提示界面": {
        "按钮": {"关闭": [936, 616, 206, 66], "确定": [1255, 615, 208, 69]},
    },
    "继续抓鬼提示界面": {
        "按钮": {"关闭": [937, 594, 202, 65], "确定": [1256, 595, 206, 65]},
    },
    "秘境降妖弹框界面": {
        "按钮": {"继续挑战": [1754, 892, 84, 92]},
    },
    "副本评分界面": {
        "按钮": {
            "第一个奖励": [699, 811, 108, 96],
            "第二个奖励": [1006, 822, 108, 85],
            "第三个奖励": [1299, 824, 111, 81],
            "第四个奖励": [1591, 824, 121, 81],
        }
    },
    "战斗失败界面": {
        "按钮": {
            "关闭": [1718, 75, 650, 955],
            "打开技能学习界面": [749, 619, 60, 79]
        }
    }
}
