from tools import TaskLineMachine


def create_baotu_task(device_id):
    sm = TaskLineMachine(device_id)

    @sm.state("活动界面")
    def _(context, 当前界面配置, 截图):
        if not 当前界面配置['按钮']['宝图任务'].设置日志('点击参加').查找().点击().随机延时(1, 3).是否找到():
            sm.stop()

    @sm.state("战斗界面")
    def _(context, 当前界面配置, 截图):
        当前界面配置['状态']['未自动战斗'].设置日志('点击未准备战斗按钮').设置大图路径(截图).查找().点击().随机延时(1, 3)

    @sm.state("主界面")
    def _(context, 当前界面配置, 截图):  
        if 当前界面配置["按钮"]["对话框第一个选项按钮"].设置日志('点击店小二对话的听听无妨按钮').设置大图路径(截图).查找().点击().随机延时(1, 3).是否找到():
            return
        
        if 当前界面配置['状态']['是否未选中任务栏'].设置日志('选中任务栏').设置大图路径(截图).查找().点击().随机延时(1, 3).是否找到():
            return

        if 当前界面配置["按钮"]["任务面板_宝图文字"].设置日志('点击任务面板的宝图任务文字').设置大图路径(截图).查找().点击().随机延时(1, 3).是否找到():
            return

        当前界面配置["按钮"]["活动"].设置日志('点击活动按钮').点击().随机延时(1, 3)

    return sm
