
from resource.assets import config as 配置
from tools import TaskLineMachine


def create_shimen_task(device_id):
    sm = TaskLineMachine(device_id)

    @sm.state(配置.继续剧情对话界面)
    def _(context):
        sm.Field(配置.继续剧情对话界面).设置标识('点击任务位置继续剧情对话').查找().点击(*配置.继续剧情对话界面['按钮']['任意位置']).随机延时(1, 3)


    @sm.state(配置.师门任务完成界面)
    def _(context):
        sm.Field(配置.师门任务完成界面).设置标识('点击确定').查找().偏移点击(*配置.师门任务完成界面['按钮']['确定']).随机延时(1, 3)
        sm.stop()


    @sm.state(配置.活动界面)
    def _(context):
        if not sm.Field(配置.活动界面['按钮']['师门任务']).设置标识('点击参加').查找().偏移点击(*配置.活动界面['按钮']['师门任务']['偏移点击区域']).随机延时(1, 3).是否找到():
            sm.stop()


    @sm.state(配置.战斗界面)
    def _(context):
        sm.Field(配置.战斗界面['状态']['是否未准备战斗']).设置标识('点击未准备战斗按钮').查找().点击(*配置.战斗界面['按钮']['未准备战斗']).随机延时(1, 3)



    @sm.state(配置.摆摊弹框界面)
    def _(context):
        sm.Field(配置.摆摊弹框界面).设置标识('选择第一个商品').查找().点击(*配置.摆摊弹框界面['按钮']['第一个商品']).随机延时(1, 3)
        sm.Field(配置.摆摊弹框界面).设置标识('点击摆摊购买按钮').查找().点击(*配置.摆摊弹框界面['按钮']['购买']).随机延时(1, 3)
        sm.Field(配置.摆摊弹框界面).设置标识('点击摆摊关闭按钮').查找().点击(*配置.摆摊弹框界面['按钮']['关闭']).随机延时(1, 3)


    @sm.state(配置.任务物品选择弹框界面)
    def _(context):
        sm.Field(配置.任务物品选择弹框界面).设置标识('点击任务物品选择弹框上交按钮').查找().点击(*配置.任务物品选择弹框界面['按钮']['上交']).随机延时(1, 3)



    @sm.state(配置.师门任务弹框界面)
    def _(context):
            if sm.Field(配置.师门任务弹框界面['按钮']['选择按钮']).设置标识('点击选择').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(配置.师门任务弹框界面['按钮']['去完成按钮']).设置标识('点击去完成').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(配置.师门任务弹框界面['按钮']['继续任务按钮']).设置标识('点击继续任务').查找().点击().随机延时(1, 3).是否找到():
                return
            
            if sm.Field(配置.师门任务弹框界面['按钮']['关闭']).设置标识('关闭师门任务弹框').查找().点击().随机延时(1, 3).是否找到():
                sm.stop()



    @sm.state(配置.主界面)
    def _(context):
            # aaa = sm.Field(配置.主界面['按钮']['对话框第一个选项按钮']).设置标识('点击对话框第一个选项按钮').查找()
            # print(aaa.x,aaa.y, "====")
            pass
            # if sm.Field(配置.主界面['按钮']['使用']).设置标识('点击使用按钮').查找().点击().随机延时(1, 3).是否找到():
            #     return
            # if sm.Field(配置.主界面['按钮']['对话框第一个选项按钮']).设置标识('点击对话框第一个选项按钮').查找().偏移点击(*配置.主界面['按钮']['对话框第一个选项按钮']['偏移点击区域']).随机延时(1, 3).是否找到():
            #     return
            # if sm.Field(配置.主界面['状态']['是否未选中任务栏']).设置标识('选中任务栏').查找().点击().随机延时(1, 3).是否找到():
            #     return
            # if sm.Field(配置.主界面_师门文字).设置标识('点击任务面板的师门文字').查找().偏移点击(*配置.主界面_师门文字['偏移点击区域']).随机延时(1, 3).是否找到():
            #     return

            # if sm.Field(配置.主界面).设置标识('点击活动按钮').查找().点击(*配置.主界面["按钮"]["活动"]).随机延时(1, 3).是否找到():
            #     return

   
    return sm







