
from resource.assets import config as 配置
from tools import TaskLineMachine


def create_shimen_task(device_id):
    sm = TaskLineMachine(device_id)

    @sm.state("继续剧情对话界面")
    def _(context):
        sm.Field(sm.界面集合["继续剧情对话界面"]).设置日志('点击任务位置继续剧情对话').查找().点击(*sm.界面集合["继续剧情对话界面"]['按钮']['任意位置']).随机延时(1, 3)
    
    @sm.state("药店界面")
    def _(context):
        sm.Field(sm.界面集合["药店界面"]).设置日志('点击购买').查找().点击(*sm.界面集合["药店界面"]['按钮']['购买']).随机延时(1, 3)


    # @sm.state(配置.师门任务完成界面)
    # def _(context):
    #     sm.Field(配置.师门任务完成界面).设置日志('点击确定').查找().点击(*配置.师门任务完成界面['按钮']['确定']).随机延时(1, 3)
    #     sm.stop()


    @sm.state("活动界面")
    def _(context):
        if not sm.Field(sm.界面集合["活动界面"]['按钮']['师门任务']).设置日志('点击参加').查找().点击().随机延时(1, 3).是否找到():
            sm.stop()


    @sm.state("战斗界面")
    def _(context):
        sm.Field(sm.界面集合["战斗界面"]['状态']['是否未准备战斗']).设置日志('点击未准备战斗按钮').查找().点击().随机延时(1, 3)



    @sm.state("摆摊弹框界面")
    def _(context):
        sm.Field(sm.界面集合["摆摊弹框界面"]).设置日志('选择第一个商品').查找().点击(*sm.界面集合["摆摊弹框界面"]['按钮']['第一个商品']).随机延时(1, 3)
        sm.Field(sm.界面集合["摆摊弹框界面"]).设置日志('点击摆摊购买按钮').查找().点击(*sm.界面集合["摆摊弹框界面"]['按钮']['购买']).随机延时(1, 3)
        sm.Field(sm.界面集合["摆摊弹框界面"]).设置日志('点击摆摊关闭按钮').查找().点击(*sm.界面集合["摆摊弹框界面"]['按钮']['关闭']).随机延时(1, 3)


    @sm.state("任务物品选择弹框界面")
    def _(context):
        sm.Field(sm.界面集合["任务物品选择弹框界面"]).设置日志('点击任务物品选择弹框上交按钮').查找().点击(*sm.界面集合["任务物品选择弹框界面"]['按钮']['上交']).随机延时(1, 3)



    @sm.state("师门任务弹框界面")
    def _(context):
            if sm.Field(sm.界面集合["师门任务弹框界面"]['按钮']['选择按钮']).设置日志('点击选择').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(sm.界面集合["师门任务弹框界面"]['按钮']['去完成按钮']).设置日志('点击去完成').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(sm.界面集合["师门任务弹框界面"]['按钮']['继续任务按钮']).设置日志('点击继续任务').查找().点击().随机延时(1, 3).是否找到():
                return
            
            if sm.Field(sm.界面集合["师门任务弹框界面"]['按钮']['关闭']).设置日志('关闭师门任务弹框').查找().点击().随机延时(1, 3).是否找到():
                sm.stop()



    @sm.state("主界面")
    def _(context):
            # if sm.Field(sm.界面集合["主界面"]['按钮']['使用']).设置日志('点击使用按钮').查找().点击().随机延时(1, 3).是否找到():
            #     return
            if sm.Field(sm.界面集合["主界面"]['按钮']['对话框第一个选项按钮']).设置日志('点击对话框第一个选项按钮').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(sm.界面集合["主界面"]['状态']['是否未选中任务栏']).设置日志('选中任务栏').查找().点击().随机延时(1, 3).是否找到():
                return
            if sm.Field(sm.界面集合["主界面"]["按钮"]["任务面板_师门文字"]).设置日志('点击任务面板的师门文字').查找().点击().随机延时(1, 3).是否找到():
                return

            if sm.Field(sm.界面集合["主界面"]).设置日志('点击活动按钮').查找().点击(*sm.界面集合["主界面"]["按钮"]["活动"]).随机延时(1, 3).是否找到():
                return

   
    return sm







