from tools import TaskLineMachine


def create_zhuagui_task(device_id):
    sm = TaskLineMachine(device_id)

    sm.update_context(是否已选择完队伍等级=False)

    @sm.state("活动界面")
    def _(context, 界面):
            # 点击抓鬼任务 参加按钮
        if not 界面.按钮.抓鬼任务.点击如果找到(日志='点击参加'):
            sm.stop()



    @sm.state("便捷组队弹框界面")
    def _(context, 界面):
        界面.按钮.创建队伍.必须点击(日志='点击创建队伍')



    @sm.state("队伍弹框界面")
    def _(context, 界面):
        if not context["是否已选择完队伍等级"]:
            # 选择等级按钮
            界面.按钮.选择等级.必须点击(日志='点击选择等级按钮')

        elif 界面.状态.队伍没满.点击如果找到(日志='队伍没满'):
            # 一键喊话
           界面.按钮.一键喊话.必须点击(日志='点击一键喊话')

            # 选择世界频道
           界面.按钮.世界频道.必须点击(日志='选择世界频道')
        else:
            #关掉
           界面.按钮.关闭.必须点击(日志='点击关闭队伍弹框')

                
            

    @sm.state("调整组队等级界面")
    def _(context, 界面):
        界面.按钮.七十至八十九等级.必须点击(日志='选择70至89等级按钮')
        界面.按钮.一至六十九等级.必须点击(日志='选择1至69等级按钮')
        界面.按钮.确定.必须点击(日志='点击确认按钮')
        context["是否已选择完队伍等级"] = True
            


    @sm.state("战斗界面")
    def _(context, 界面):
        界面.状态.未准备战斗.必须点击(日志='点击未准备战斗按钮')



    @sm.state("继续抓鬼提示界面")
    def _(context, 界面):
        界面.按钮.确定.必须点击(日志='点击确定继续抓鬼提示按钮')



    @sm.state("缺人调整队伍提示界面")
    def _(context, 界面):
        界面.按钮.关闭.必须点击(日志='点击关闭缺人调整队伍提示按钮')


    @sm.state("缺人自动匹配提示界面")
    def _(context, 界面):
        界面.按钮.确定.必须点击(日志='点击确定缺人自动匹配提示按钮')



    # @sm.state("队伍缺辅助提示界面")
    # def _(context, 界面):
    #     界面.按钮.关闭.必须点击(日志='点击关闭队伍缺辅助提示按钮')


    @sm.state("主界面")
    def _(context, 界面):
        (界面.按钮.对话框第一个选项按钮.点击如果找到(日志='点击钟馗对话的抓鬼任务按钮')
        or 界面.状态.未选中任务栏.点击如果找到(日志='选中任务栏')
        or 界面.按钮.任务面板_抓鬼文字.点击如果找到(日志='点击任务面板的抓鬼任务文字')
        or 界面.按钮.活动.必须点击(日志='点击活动按钮'))


    return sm
