# from resource.assets import config as 配置
# from tools import TaskLineMachine


def create_zhuagui_task(device_id):
    pass
    # sm = TaskLineMachine(device_id)

    # sm.update_context(是否已选择完队伍等级=False)

    # @sm.state(配置.活动界面)
    # def _(context):
    #         # 点击抓鬼任务 参加按钮
    #     if not sm.Field(配置.活动界面['按钮']['抓鬼任务']).设置日志('点击参加').查找().点击().随机延时(1, 3).是否找到():
    #         sm.stop()



    # @sm.state(配置.便捷组队弹框界面)
    # def _(context):
    #         sm.Field(配置.便捷组队弹框界面).设置日志('点击创建队伍').查找().点击(*配置.便捷组队弹框界面['按钮']['创建队伍']).随机延时(1, 3)



    # @sm.state(配置.队伍弹框界面)
    # def _(context):
    #         if not context["是否已选择完队伍等级"]:
    #             # 选择等级按钮
    #             sm.Field(配置.队伍弹框界面).设置日志('点击选择等级按钮').查找().点击(*配置.队伍弹框界面["按钮"]["选择等级"]).随机延时(1, 3)

    #         elif sm.Field(配置.队伍弹框界面['状态']['是否队伍没满']).设置日志('是否队伍没满', True).查找().是否找到():
    #             # 一键喊话
    #             sm.Field(配置.队伍弹框界面).设置日志('点击一键喊话').查找().点击(*配置.队伍弹框界面["按钮"]["一键喊话"]).随机延时(1, 3)

    #             # 选择世界频道
    #             sm.Field(配置.队伍弹框界面).设置日志('选择世界频道').查找().点击(*配置.队伍弹框界面["按钮"]["世界频道"]).随机延时(1, 3)

    #         else:
    #             #关掉
    #             sm.Field(配置.队伍弹框界面).设置日志('点击关闭队伍弹框').查找().点击(*配置.队伍弹框界面["按钮"]["关闭"]).随机延时(1, 3)
                
            

    # @sm.state(配置.调整组队等级界面)
    # def _(context):
    #         sm.Field(配置.调整组队等级界面).设置日志('选择70-89等级按钮').查找().点击(*配置.调整组队等级界面["按钮"]["70-89等级"]).随机延时(1, 3)

    #         sm.Field(配置.调整组队等级界面).设置日志('选择1-69等级按钮').查找().点击(*配置.调整组队等级界面["按钮"]["1-69等级"]).随机延时(1, 3)

    #         if sm.Field(配置.调整组队等级界面).设置日志('点击确认按钮').查找().点击(*配置.调整组队等级界面["按钮"]["确定"]).随机延时(1, 3).是否找到():
    #             context["是否已选择完队伍等级"] = True
            


    # @sm.state(配置.战斗界面)
    # def _(context):
    #     sm.Field(配置.战斗界面['状态']['是否未准备战斗']).设置日志('点击未准备战斗按钮').查找().点击(*配置.战斗界面['按钮']['未准备战斗']).随机延时(1, 3)



    # @sm.state(配置.继续抓鬼提示)
    # def _(context):
    #     sm.Field(配置.继续抓鬼提示).设置日志('点击关闭继续抓鬼提示').查找().点击(*配置.继续抓鬼提示["按钮"]["关闭"]).随机延时(1, 3)



    # @sm.state(配置.缺人自动匹配提示)
    # def _(context):
    #     sm.Field(配置.缺人自动匹配提示).设置日志('点击缺人自动匹配提示').查找().点击(*配置.缺人自动匹配提示["按钮"]["关闭"]).随机延时(1, 3)



    # @sm.state(配置.队伍缺辅助提示)
    # def _(context):
    #     sm.Field(配置.队伍缺辅助提示).设置日志('点击关闭队伍缺辅助提示').查找().点击(*配置.队伍缺辅助提示["按钮"]["关闭"]).随机延时(1, 3)


    # @sm.state(配置.主界面)
    # def _(context):
    #         if sm.Field(配置.主界面_钟馗对话).设置日志('点击钟馗对话的抓鬼任务按钮').查找().点击(*配置.主界面_钟馗对话['按钮']['抓鬼任务']).随机延时(1, 3).是否找到():
    #             return

    #         if sm.Field(配置.主界面['状态']['是否未选中任务栏']).设置日志('选中任务栏').查找().点击().随机延时(1, 3).是否找到():
    #             return

    #         if sm.Field(配置.主界面_抓鬼文字).设置日志('点击任务面板的抓鬼任务文字').查找().点击().随机延时(1, 3).是否找到():
    #             return

    #         sm.Field(配置.主界面).设置日志('点击活动按钮').查找().点击(*配置.主界面["按钮"]["活动"]).随机延时(1, 3)

    # return sm
