from index import Field, TaskLineMachine
from resource.assets import config as 配置

sm = TaskLineMachine()

@sm.state(配置.活动界面)
def _(context):
       if not Field(配置.活动界面['按钮']['秘境降妖']).设置标识('点击参加').查找().偏移点击(*配置.活动界面['按钮']['秘境降妖']['偏移点击区域']).随机延时(1, 3).是否找到():
           sm.stop()



@sm.state(配置.战斗界面)
def _(context):
    Field(配置.战斗界面['状态']['是否未准备战斗']).设置标识('点击未准备战斗按钮').查找().点击(*配置.战斗界面['按钮']['未准备战斗']).随机延时(1, 3)


@sm.state(配置.秘境降妖弹框界面)
def _(context):
    Field(配置.秘境降妖弹框界面).设置标识('点击继续挑战按钮').查找().点击(*配置.秘境降妖弹框界面['按钮']['继续挑战']).随机延时(1, 3)


@sm.state(配置.主界面)
def _(context):
        if Field(配置.主界面_云乐游对话).设置标识('点击云乐游对话的秘境降妖按钮').查找().点击(*配置.主界面_云乐游对话['按钮']['秘境降妖']).随机延时(1, 3).是否找到():
            return

        if Field(配置.主界面_秘境降妖文字).设置标识('点击主界面的秘境降妖文字').查找().偏移点击(*配置.主界面_秘境降妖文字['偏移点击区域']).随机延时(1, 3).是否找到():
            return

        # Field(配置.主界面).设置标识('点击活动按钮').查找().点击(*配置.主界面["按钮"]["活动"]).随机延时(1, 3)



if __name__ == "__main__":
    result = sm.start()
    # print("秘境降妖结束")
    # print(Field(配置.主界面).设置标识('点击活动按钮').查找().是否找到())
    # print(Field(配置.主界面_秘境降妖文字).设置标识('点击主界面的秘境降妖文字').查找().是否找到())
    # Field(配置.秘境降妖弹框界面).设置标识('点击继续挑战按钮').查找()


