
from index import Field, TaskLineMachine
from resource.assets import config as 配置

sm = TaskLineMachine()



@sm.state(配置.活动界面)
def _(context):
       if not Field(配置.活动界面['按钮']['运镖']).设置标识('点击参加').查找().偏移点击(*配置.活动界面['按钮']['运镖']['偏移点击区域']).随机延时(1, 3).是否找到():
           sm.stop()

@sm.state(配置.战斗界面)
def _(context):
    Field(配置.战斗界面['状态']['是否未准备战斗']).设置标识('点击未准备战斗按钮').查找().点击(*配置.战斗界面['按钮']['未准备战斗']).随机延时(1, 3)


@sm.state(配置.运镖地图界面)
def _(context):
   1


@sm.state(配置.押送普通镖银提示)
def _(context):
    Field(配置.押送普通镖银提示).设置标识('点击确定').查找().点击(*配置.押送普通镖银提示['按钮']['确定']).随机延时(1, 3)


@sm.state(配置.押送高级镖银提示)
def _(context):
    Field(配置.押送高级镖银提示).设置标识('点击确定').查找().点击(*配置.押送高级镖银提示['按钮']['确定']).随机延时(1, 3)




@sm.state(配置.主界面)
def _(context):
        if Field(配置.押送普通镖银).设置标识('点击押送普通镖银按钮').查找().点击().随机延时(1, 3).是否找到():
            return
            
        # if Field(配置.押送高级镖银).设置标识('点击押送高级镖银按钮').查找().点击().随机延时(1, 3).是否找到():
        #     return

        if Field(配置.主界面).设置标识('点击活动按钮').查找().点击(*配置.主界面["按钮"]["活动"]).随机延时(1, 3).是否找到():
            return







if __name__ == "__main__":
    # Field(配置.主界面).设置标识('点击活动按钮').查找()


    result = sm.start()
    print("宝图任务结束")



