import os


# ========== 基础界面配置（固定元素）==========

主界面 = {
    "标识": "主界面",
    "方式": "opencv找透明图",
    '状态': {
        '是否未选中任务栏': {
            "方式": "opencv找透明图",
            "图片路径": os.path.join(os.path.dirname(__file__), "主界面_未选中任务.png"),
        }
    },
    "按钮": {
        "活动": [574, 24, 73, 73],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "aaaa.png"),
}


活动界面 = {
    "标识": "活动界面",
    "方式": "opencv找图",
    '按钮': {
        '抓鬼任务': {
            "方式": "opencv找图",
            '偏移点击区域': [308, 33,116, 56],
            "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务.png"),
        },
        '宝图任务': {
            "方式": "opencv找图",
            '偏移点击区域': [304, 30, 121, 54],
            "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务.png"),
        },
        '秘境降妖': {
            "方式": "opencv找图",
            '偏移点击区域': [306, 24, 118, 64],
            "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖.png"),
        }
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "活动界面.png"),
}



队伍弹框界面 = {
    "标识": "队伍弹框界面",
    "方式": "opencv找图",
    '状态': {
        '是否队伍没满': {
            "方式": "opencv找图",
            "图片路径": os.path.join(os.path.dirname(__file__), "队伍没满.png"),
        }
    },
    "按钮": {
        "关闭": [1866, 35, 61, 62],
        "选择等级": [1491, 146, 58, 53],
        "一键喊话": [1628, 953, 261, 72],
        "世界频道": [1641, 693, 232, 96],
    },
    "图片路径": os.path.join(
        os.path.dirname(__file__), "队伍界面.png"
    ),
}

便捷组队弹框界面 = {
    "标识": "便捷组队弹框界面",
    "方式": "opencv找图",
    '按钮': {
        '创建队伍': [897, 950, 264, 70]
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "便捷组队弹框界面.png"),
}

调整组队等级界面 = {
    "标识": "调整组队等级界面",
    "方式": "opencv找图",
    "按钮": {
        "70-89等级": [1516, 467, 112, 54],
        "1-69等级": [1383, 467, 114, 53],
        "90-115等级": [1646, 466, 116, 52],
        "确定": [1086, 948, 230, 67],
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "调整组队等级界面.png"),
}

战斗界面 = {
    "标识": "战斗界面",
    "方式": "opencv找透明图",
    "状态": {
        "是否未准备战斗": {
            "方式": "opencv找透明图",
            "图片路径": os.path.join(os.path.dirname(__file__), "准备战斗.png"),
        },
    },
    "按钮": {"未准备战斗": [2210, 935, 79, 76]},
    "图片路径": os.path.join(os.path.dirname(__file__), "战斗界面.png"),
}


缺人自动匹配提示 = {
    "标识": "缺人自动匹配提示",
    "方式": "opencv找图",
    "按钮": {"关闭": [1257, 617, 210, 68]},
    "图片路径": os.path.join(os.path.dirname(__file__), "缺人自动匹配提示.png"),
}

秘境降妖弹框界面 = {
    "标识": "秘境降妖弹框界面",
    "方式": "opencv找图",
    "按钮": {
        "继续挑战": [1754, 892, 84, 92]
        },
    "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖弹框界面.png"),
}





# ========== 抓鬼任务模块 ==========



主界面_钟馗对话 = {
    "方式": "opencv找图",
    '按钮': {
        '抓鬼任务': [1829, 361, 403, 66]
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/钟馗.png"),
}

主界面_抓鬼文字 = {
    "方式": "opencv找透明图",
    '偏移点击区域': [0, 0, 350, 114],
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/主界面_抓鬼文字.png"),
}

队伍缺辅助提示 = {
    "标识": "队伍缺辅助提示",
    "方式": "opencv找图",
    '按钮': {
        "关闭": [940, 640, 201, 69]
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "抓鬼任务/队伍缺辅助.png"),
}

继续抓鬼提示 = {
    '标识': '继续抓鬼提示',
    '方式': 'opencv找图',
    '按钮': {
        '关闭': [936, 593, 205, 65]
    },
    '图片路径': os.path.join(os.path.dirname(__file__), '抓鬼任务/继续抓鬼提示.png')
}


# ========== 宝图任务模块 ==========

主界面_店小二对话 = {
    "方式": "opencv找图",
    '按钮': {
        '听听无妨': [1823, 358, 414, 73]
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务/主界面_店小二对话.png"),
}

主界面_宝图文字 = {
    "方式": "opencv找透明图",
    '偏移点击区域': [0, 0, 348, 123],
    "图片路径": os.path.join(os.path.dirname(__file__), "宝图任务/主界面_宝图文字.png"),
}


# ========== 秘境降妖模块 ==========

主界面_云乐游对话 = {
    "方式": "opencv找图",
    '按钮': {
        '秘境降妖': [1823, 257, 411, 73]
    },
    "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖/主界面_云乐游对话.png"),
}

主界面_秘境降妖文字 = {
    "方式": "opencv找透明图",
    '偏移点击区域': [0, 0, 363, 109],
    "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖/主界面_秘境降妖文字.png"),
}

主界面_离开秘境降妖按钮 = {
    "方式": "opencv找透明图",
    "图片路径": os.path.join(os.path.dirname(__file__), "秘境降妖/离开秘境降妖按钮.png"),
}